/**
 * Пакет содержит классы, в конечном счёте предоставляющие API для работы с погодой
 *
 * Структура пакета следующая:
 * * * * пакет common - содержит классы-обёртки для формирования ответа
 * * * * пакет controller - содержит контроллеры
 * * * * пакет dao - содержит классы доступа к данным
 * * * * пакет model - содержит entity-классы
 * * * * пакет service - содержит сервисы
 * * * * пакет view - содержит классы для конечного представления данных
 *
 * @author Artyom Karkavin
 */
package ru.touchit.api;